---
kind: type
id: T:Autodesk.Revit.DB.DrawLayer
source: html/f8bb7719-7ae5-e4a2-ea4d-6a3d38cec363.htm
---
# Autodesk.Revit.DB.DrawLayer

An enumerated type containing possible DrawLayer options.

## Syntax (C#)
```csharp
public enum DrawLayer
```